<?php

namespace rabint\finance\addons;

use Yii;
use rabint\helpers\uri;
use vendor\rabint\finance\addons\nusoap_client;

class ParsianGateway extends GatewayAbstract
{

    //    function afterPay() {
    //        
    //    }

    public function __construct()
    {
        $this->code = 4;
        $this->slug = 'parsian';
        $this->title = Yii::t('rabint', 'بانک پارسیان');
        $this->config = [
            'url' => 'https://pec.shaparak.ir/NewIPGServices/Sale/SaleService.asmx?wsdl',
            'gonfirm' => 'https://pec.shaparak.ir/NewIPGServices/Confirm/ConfirmService.asmx?wsdl',
            'gateway_url' => 'https://pec.shaparak.ir/NewIPG/?Token=',
            'PIN' => 'q8W0qHWCir4JodtFlWIe',
        ];
        $this->gatewaySuccessStatus = 0;
        $this->messages = [
            1001 => Yii::t('rabint', 'خطا در اتصال به درگاه بانک'),
            1002 => Yii::t('rabint', 'خطای نامشخص'),
            1003 => Yii::t('rabint', 'در حال انتقال به درگاه بانک'),
            1004 => Yii::t('rabint', 'پرداخت معتبر نمی باشد'),
            1005 => Yii::t('rabint', 'خطای امنیتی رخ داده است'),
            /* ------------------------------------------------------ */
            0 => Yii::t('rabint', 'پرداخت موفقیت آمیز بود'),

            20 => Yii::t('rabint', 'پین فروشنده درست نیست'),
            22 => Yii::t('rabint', 'آی پی فروشنده مطابقت ندارد'),
            23 => Yii::t('rabint', 'عملیات قبلاً با موفقیت انجام شده'),
            24 => Yii::t('rabint', 'شماره تراکنش درست نیست !'),
            -126 => Yii::t('rabint', "کد شناسایی پذیرنده معتبر نمی باشد"),
            32768 => 'خطای نا شناخته رخ داده است',
            -32004 => "خطا در فراخوانی سرویس درخواست خرید تسهیم آفالین",
            -32003 => "مبلغ کل با جمع مبالغ تسهیم شده برابر نمی باشد",
            -32002 => "مبلغ در یک یا چند آیتم داده شده معتبر نمی باشد",
            -32001 => "لیست شماره شباها خالی است",
            -32000 => "خطا در فراخوانی سرویس کنترل شبای ذینفعان تسهیم آفالین",
            -20000 => "برخی از شباها معتبر نمی باشد",
            -1638 => "فراخوانی سرویس درخواست شارژ تاپ آپ ناموفق بود",
            -1637 => "Single-Phased UD Payment SW 2 exception",
            -1636 => "Single-Phased USSD Topup Charge Payment Exception",
            -1635 => "Single-Phased USSD Sale Payment Exception",
            -1634 => "Single-Phased USSD Bill Payment Exception",
            -1633 => "Non of batch bill request items transaction was successful.",
            -1632 => "No batch bill request items found to process",
            -1631 => "Some of bill items transaction was successful.",
            -1630 => "Failed to continue batch bill transactions because of a not continuable status occured.",
            -1629 => "Batch Transaction Exception.",
            -1628 => "اندیس پیوند کارت معتبر نمی باشد",
            -1627 => "اندیس کارت معتبر نمی باشد",
            -1626 => "انجام تراکنش روی این درگاه مجاز نمی باشد",
            -1625 => "تراکنشی برای درخواست انجام نشده است که قابل برگشت باشد",
            -1624 => "شارژ کارت ناموفق می باشد",
            -1623 => "استثنای فراخوانی سرویس صادرکننده",
            -1622 => "استثنا در کنترل محدودیت پذیرنده برای شماره کارت",
            -1621 => "انجام تراکنش محدود به کارت های پذیرنده می باشد",
            -1620 => "تاپ آپ در درگاه ناموفق بود .جهت رفع مغایرت با مرکز تماس به شماره  ",
            -1619 => "تاپ آپ در واسط سرویس ناموفق بود .جهت رفع مغایرت با مرکز تماس به شماره  ",
            -1618 => "تاپ آپ توسط تامین کننده ناموفق بود .جهت رفع مغایرت با مرکز تماس به شماره  ",
            -1617 => "خطای بانک در شارژ تاپآپ .به کد وضعیت بانک مراجعه شود",
            1616 => "خطا در پردازش تراکنش پرداخت با کد QR",
            -1614 => "خطا در ذخیره درخواست پرداخت با کد QR",
            -1613 => "خطا در بازیابی اطالعات پذیرنده کتابخانه پرداخت موبایلی",
            -1612 => "خطا در اعتبارسنجی درخواست پرداخت توسط کتابخانه پرداخت موبایلی",
            -1611 => "اشکال در بازیابی شماره سفارش جدید",
            -1610 => "خطای بانک در پرداخت.به کد وضعیت بانک مراجعه شود",
            -1609 => "خطای بانک در پرداخت .به کد وضعیت بانک مراجعه شود",
            -1608 => "خطای بانک در پرداخت قبض.به کد وضعیت بانک مراجعه شود",
            -1607 => "اشکال در عملیات پرداخت قبض بصورت تک فاز",
            -1606 => "Iso Reversal failed",
            -1605 => "Iso Advice failed",
            -1604 => "خطا در به روز رسانی اطالعات تراکنش ارسالی به سوئیچ بانکی",
            -1603 => "اشکال در عملیات تراکنش موبایل خرید سرویس پرداخت",
            -1602 => "اشکال در عملیات تراکنش موبایل قبض سرویس پرداخت",
            -1601 => "اشکال در عملیات تراکنش موبایل خرید سرویس پرداخت",
            -1600 => "اشکال در عملیات تراکنش شارژ تاپ آپ سرویس پرداخت",
            -1599 => "اشکال در عملیات تراکنش اینترنتی قبض سرویس پرداخت",
            -1598 => "اشکال در عملیات تراکنش اینترنتی خرید سرویس پرداخت",
            -1597 => "اشکال در عملیات بازیابی اطالعات تراکنش تاپ آپ سرویس پرداخت",
            -1596 => "اشکال در عملیات بازیابی اطالعات تراکنش قبض سرویس پرداخت",
            -1595 => "اشکال در عملیات بازیابی اطالعات تراکنش خرید سرویس پرداخت",
            -1594 => "اشکال در عملیات بازیابی اطالعات تراکنش تاپ آپ ام پی ال",
            -1593 => "اشکال در عملیات بازیابی اطالعات تراکنش قبض ام پی ال",
            -1592 => "اشکال در عملیات بازیابی اطالعات تراکنش خرید ام پی ال",
            -1591 => "توکن کارت معتبر نمی باشد",
            -1590 => "شماره موبایل شارژ شونده معتبر نمی باشد",
            -1589 => "نقض قالب مقدار عددی",
            -1588 => "IsoWrapper.DoTransaction failure in TransactionRule",
            -1587 => "اطالعات درخواست پرداخت در منطق تراکنش یافت نشد",
            -1586 => "خطا در تبدیل پاسخ ایزو به خروجی BusinessRule",
            -1585 => "عملیات برگشت تراکنش در سرویس برگشت تراکنش ناموفق بود",
            -1584 => "اشکال در عملیات تراکنش موبایل خرید MPL",
            -1583 => "اشکال در عملیات تراکنش موبایل قبض MPL",
            -1582 => "اشکال در عملیات تراکنش موبایل خرید MPL",
            -1581 => "اشکال در عملیات تراکنش شارژ تاپ آپ MPL",
            -1580 => "اشکال در عملیات تراکنش اینترنتی قبض MPL",
            -1579 => "اشکال در عملیات تراکنش اینترنتی خرید MPL",
            -1578 => "فراخوانی سرویس درخواست خرید  UDناموفق بود",
            -1577 => "اشکال در عملیات خرید شارژ تاپ آپ بصورت تک فاز",
            -1576 => "اشکال در عملیات خرید بصورت تک فاز",
            -1575 => "",
            -1574 => "خطا در اجرای متد ایندکس صفحه پرداخت",
            -1573 => "پس از اجرای متد ایندکس صفحه پرداخت",
            -1572 => "پیش از اجرای متد ایندکس صفحه پرداخت",
            -1571 => "اشکال در بارگذاری صفحه پرداخت",
            -1570 => "فرآیند پرداخت در صفحه درگاه پرداخت با اشکالی مواجه شد",
            -1569 => "کاپچا معتبر نبود",
            -1568 => "مدل صفحه پرداخت معتبر نبود",
            -1567 => "پرداخت قبض داده شده به دلیل محدودیت امکانپذیر نمی باشد",
            -1564 => "اشکال در عملیات پرداخت تک فاز",
            -1563 => "تمامی پرداخت ها ناموفق می باشد",
            -1562 => "بخشی از قبوض پرداخت شده و بخشی دچار مشکل شده است",
            -1561 => "تاییده تراکنش ناموفق می باشد -مشکلی در سیستم رخ داده لطفامجددا تالش نمایید",
            -1560 => "",
            -1555 => "هیچ یک از قبوض داده شده معتبر نبود .وضعیت قبوض را بررسی نمایید",
            -1554 => "تعدادی از قبوض داده شده پذیرش شد .وضعیت قبوض را بررسی نمایید",
            -1553 => "خطا در درج درخواست قبض گروهی",
            -1552 => "برگشت تراکنش مجاز نمی باشد",
            -1551 => "برگشت تراکنش قبالً انجام شده است",
            -1550 => "برگشت تراکنش در وضعیت جاری امکان پذیر نمی باشد",
            -1549 => "زمان مجاز برای درخواست برگشت تراکنش به اتمام رسیده است",
            -1548 => "فراخوانی سرویس درخواست پرداخت قبض ناموفق بود",
            -1547 => "تراکنش برگشت به سوئیچ ارسال شد",
            -1546 => "تراکنش برگشت در انتظار برای ارسال به سوئیچ است",
            -1545 => "درج وضعیت تراکنش پیش از ارسال تراکنش تاییدیه ناموفق بود",
            -1544 => "تراکنش تاییدیه با موفقیت به سوئیچ ارسال شد",
            -1543 => "درج وضعیت تراکنش پیش از ارسال تراکنش تاییدیه ناموفق بود",
            -1542 => "تراکنش تاییدیه در انتظار برای ارسال است",
            -1541 => "درج وضعیت انجام تراکنش در سوئیچ ناموفق می باشد",
            -1540 => "تایید تراکنش ناموفق می باشد",
            -1539 => "Payment is not successful to advice.",
            -1538 => "ValidateBeforeConfirm failed",
            -1537 => "An error occured in BeforeSaveRequest",
            -1536 => "فراخوانی سرویس درخواست شارژ تاپ آپ ناموفق بود",
            -1535 => "درج نشانگر تأیید تراکنش موفق ،موفقیت آمیز نبود",
            -1534 => "Successful Audit Time was not found.",
            -1533 => "تراکنش قبالً تایید شده است",
            -1532 => "تراکنش از سوی پذیرنده تایید شد",
            -1531 => "تایید تراکنش ناموفق امکان پذیر نمی باشد",
            -1530 => "پذیرنده مجاز به تایید این تراکنش نمی باشد",
            -1529 => "بازیابی اطالعات پرداخت برای تایید تراکنش ناموفق بود",
            -1528 => "اطالعات پرداخت یافت نشد",
            -1527 => "انجام عملیات درخواست پرداخت تراکنش خرید ناموفق بود",
            -1524 => "درج مرحله پایان پرداخت ناموفق می باشد",
            -1523 => "پردازش فرآیند انجام تراکنش ناموفق می باشد",
            -1522 => "Unable to find PaymentSwitchConfig record for current transaction request.",
            -1521 => "Iso Creation failed.",
            -1520 => "درج مرحله آماده بودن تراکنش برای ارسال به سویچ ناموفق می باشد",
            -1519 => "تراکنش آماده ارسال به سوئیچ می باشد",
            -1518 => "درج مرحله شروع پرداخت ناموفق می باشد",
            -1517 => "کاربر دکمه پرداخت را فشرده است",
            -1516 => "درج اطالعات تراکنش پرداخت ناموفق می باشد",
            -1515 => "درج اطالعات درخواست پرداخت ناموفق می باشد",
            -1514 => "درج مرحله بارگذاری صفحه درگاه پرداخت ناموفق می باشد",
            -1513 => "درج مرحله ارسال تراکنش برگشت به سویچ ناموفق می باشد",
            -1512 => "درج مرحله ارسال تراکنش تاییده به سویج ناموفق می باشد",
            -1511 => "درج مرحله درخواست تایید تراکنش ناموفق می باشد",
            -1510 => "درج مرحله ارجاع به سایت پذیرنده ناموفق می باشد",
            -1509 => "درج مرحله ارسال تراکنش به سویچ ناموفق می باشد",
            -1508 => "درج مرحله ثبت درخواست اولیه پرداخت ناموفق می باشد",
            -1507 => "تراکنش برگشت به سوئیچ ارسال شد",
            -1506 => "تراکنش تاییدیه به سوئیچ ارسال شد",
            -1505 => "تایید تراکنش توسط پذیرنده انجام شد",
            -1504 => "درگاه پرداخت اینترنتی صفحه پرداخت را به پذیرنده ارجاع داد",
            -1503 => "تراکنش پرداخت به سوئیچ ارسال شد",
            -1502 => "کاربر وارد صفحه درگاه پرداخت اینترتی شد",
            -1500 => "ثبت اولیه درخواست",
            -1006 => "Can not get ISO Response Code from Message",
            -1005 => "Iso Response Parse Error",
            -1004 => "طول داده دریافتی از سوئیچ نامعتبر است",
            -1003 => "خطا در انجام تراکنش روی سوئیچ",
            -1002 => "خطا در ارسال اطالعات به سوئیچ",
            -1001 => "خطا در اتصال و یا دریافت اطالعات از سوئیچ Network Timeout",
            -1000 => "خطا در در یافت اطالعات از سوئیچ",
            -501 => "خطا در برقراری ارتباط شبکه ای با دیتابیس",
            -500 => "خطا در درج اطالعات",
            -155 => "اجازه پرداخت تک فاز اعطا نشده است",
            -154 => "Either Card Number or Card Index parameters must be specified.",
            -153 => "قالب شناسه حساب صحیح نمی باشد",
            -152 => "عدم وجود شناسه حساب در داده اضافی",
            -148 => "پارامتر ورودی معتبر نمی باشد",
            -147 => "نوع شارژ معتبر نمی باشد",
            -146 => "شماره موبایل برای شارژ معتبر نمی باشد",
            -145 => "اقالم تسهیم تعیین نشده است",
            -144 => "مبلغ در برخی از اقالم معتبر نمی باشد",
            -143 => "جمع مبالغ تسهیم با مبلغ تراکنش مغایرت دارد",
            -142 => "شناسه قبض یا پرداخت معتبر نمی باشد",
            -141 => "طول رمز دوم معتبر نمی باشد",
            -140 => "رمز دوم معتبر نمی باشد",
            -139 => "کد امنیتی وارد شده صحیح نمی باش",
            -138 => "عملیات پرداخت توسط کاربر لغو شد",
            -137 => "DelegateCode does not end with CheckDigit.",
            -136 => "DelegateCode length is less than or equal to CheckDigit.",
            -135 => " CheckDigitمعتبر نمی باشد",
            -134 => " DelegatePassمعتبر نمی باشد",
            -133 => " DelegateCodeمعتبر نمی باشد",
            -132 => "مبلغ تراکنش کمتر از حداقل مجاز می باشد",
            -131 => " Tokenنامعتبر می باشد",
            -130 => "توکن منقضی شده است",
            -129 => "قالب داده ورودی صحیح نمی باشد",
            -128 => "قالب آدرس  IPمعتبر نمی باشد",
            -127 => "آدرس اینترنتی معتبر نمی باشد",
            -126 => "کد شناسایی پذیرنده معتبر نمی باشد",
            -125 => "کد  CVV",
            -124 => "لطفا فیلد رمز اینترنتی کارت را کامل کنید",
            -123 => "تاریخ انقضای کارت معتبر نمی باشد",
            -122 => "شماره کارت معتبر نمی باشد",
            -121 => "رشته داده شده بطور کامل عددی نمی باشد",
            -120 => "طول داده ورودی معتبر نمی باشد",
            -119 => "سازمان نامعتبر می باشد",
            -118 => "مقدار ارسال شده عدد نمی باشد",
            -117 => "طول رشته کم تر از حد مجاز می باشد",
            -116 => "طول رشته بیش از حد مجاز می باشد",
            -115 => "شناسه پرداخت نامعتبر می باشد",
            -114 => "شناسه قبض نامعتبر می باشد",
            -113 => "پارامتر ورودی خالی می باشد",
            -112 => "شناسه سفارش تکراری است",
            -111 => "مبلغ تراکنش بیش از حد مجاز پذیرنده می باشد",
            -110 => "قابلیت  OCPبرای پذیرنده غیر فعال می باشد",
            -109 => "قابلیت پرداخت خرید کاالی ایرانی برای پذیرنده غیر فعال می باشد",
            -108 => "قابلیت برگشت تراکنش برای پذیرنده غیر فعال می باشد",
            -107 => "قابلیت ارسال تاییده تراکنش برای پذیرنده غیر فعال می باشد",
            -106 => "قابلیت شارژ برای پذیرنده غیر فعال می باشد",
            -105 => "قابلیت تاپ آپ برای پذیرنده غیر فعال می باشد",
            -104 => "قابلیت پرداخت قبض برای پذیرنده غیر فعال می باشد",
            -103 => "قابلیت خرید برای پذیرنده غیر فعال می باشد",
            -102 => "تراکنش با موفقیت برگشت داده شد",
            -101 => "پذیرنده اهراز هویت نشد",
            -100 => "پذیرنده غیرفعال می باشد",
            -1 => "خطای سرور",
            0 => "موفق",
            1 => "صادرکننده ی کارت از انجام تراکنش صرف نظر کرد",
            2 => "عملیات تاییدیه این تراکنش قبال باموفقیت صورت پذیرفته است",
            3 => "پذیرنده ی فروشگاهی نامعتبر می باشد",
            4 => "کارت توسط دستگاه ضبط شود",
            5 => "از انجام تراکنش صرف نظر شد",
            6 => "بروز خطایی ناشناخته",
            7 => "به دلیل شرایط خاص کارت توسط دستگاه ضبط شود",
            8 => "باتشخیص هویت دارنده ی کارت ،تراکنش موفق می باشد",
            9 => "درخواست رسیده در حال پی گیری و انجام است",
            10 => "تراکنش با مبلغی پایین تر از مبلغ درخواستی ( کمبود پول  ATMیا حساب مشتری ) پذیرفته شده است",
            11 => "تراکنش با وجود احتمالی برخی مشکالت پذیرفته شده است ( به علت چایگاه مشتری )VIP",
            12 => "تراکنش نامعتبر است",
            13 => "مبلغ تراکنش اصالحیه نادرست است",
            14 => "شماره کارت ارسالی نامعتبر است (وجود ندارد)",
            15 => "صادرکننده ی کارت نامعتبراست (وجود ندارد)",
            16 => "تراکنش مورد تایید است و اطالعات شیار سوم کارت به روز رسانی شود",
            17 => "مشتری درخواست کننده حذف شده است",
            18 => "در مواقعی که یک تراکنش به هر دلیل پذیرفته نشده است و یا با شرایط خاصی پذیرفته شده است در صورت تایید و یا سماجت مشتری این پیغام را خواهیم داشتپ",
            19 => "تراکنش مجددا ارسال شود",
            20 => "در موقعیتی که سوئیچ جهت پذیرش تراکنش نیازمند پرس و جو از کارت است ممکن است درخواست از کارت ( ترمینال) بنماید این پیام مبین نامعتبر بودن جواب است",
            21 => "در صورتی که پاسخ به در خواست ترمینا ل نیازمند هیچ پاسخ خاص یا عملکردی نباشیم این پیام را خواهیم داشت",
            22 => "تراکنش مشکوک به بد عمل کردن ( کارت  ،ترمینال  ،دارنده کارت ) بوده است لذا پذیرفته نشده است",
            23 => "کارمزد ارسالی پذیرنده غیر قابل قبول است",
            24 => "زمانی که یک تراکنش نیازمند عمل کرد یا فراخوانی فایلی خاص باشد و فایل مذکرو در مبدا درخواست موجود نباشد این پیام را خواهیم داشت",
            25 => "تراکنش اصلی یافت نشد",
            26 => "عملیات فایل تکراری",
            27 => "خطا در اصالح فیلد اطالعاتی",
            28 => "فایل مورد نظر  lockشده است",
            29 => "عملیات فایل ناموفق",
            30 => "قالب پیام دارای اشکال است",
            31 => "پذیرنده توسط سوئی پشتیبانی نمی شود",
            32 => "تراکنش به صورت غیر قطعی کامل شده است ( به عنوان مثال تراکنش سپرده گزاری که از دید مشتری کامل شده است ولی می بایست تکمیل گردد",
            33 => "تاریخ انقضای کارت سپری شده است .کارت توسط دستگاه ضبط شود",
            34 => "تراکنش اصلی باموفقیت انجام نپذیرفته است",
            35 => "بنابر توصیه موسسه یا بانک مدیر کارت به پذیرنده کارت ضبط شده است",
            36 => "کارت محدود شده است .کارت توسط دستگاه ضبط شود",
            37 => "پذیرنده در نتیجه چنین درخواستی با بخش امنیتی موسسه یا بانک مدیر کارت تماس گرفته است ( یا میگیرد )",
            38 => "تعداد دفعات ورود رمزغلط بیش از حدمجاز است .کارت توسط دستگاه ضبط شود",
            39 => "کارت حساب اعتباری ندارد",
            40 => "عملیات درخواستی پشتیبانی نمی گردد",
            41 => "کارت مفقودی می باشد .کارت توسط دستگاه ضبط شود",
            42 => "کارت حساب عمومی ندارد",
            43 => "کارت مسروقه می باشد .کارت توسط دستگاه ضبط شود",
            44 => "کارت حساب سرمایه گذاری ندارد",
            45 => "قبض قابل پرداخت نمی باشد",
            51 => "موجودی کافی نمی باشد",
            52 => "کارت حساب جاری ندارد",
            53 => "کارت حساب قرض الحسنه ندارد",
            54 => "تاریخ انقضای کارت سپری شده است",
            55 => "رمز کارت نا معتبر است",
            56 => "کارت نا معتبر است",
            57 => "انجام تراکنش مربوطه توسط دارنده ی کارت مجاز نمی باشد",
            58 => "انجام تراکنش مربوطه توسط پایانه ی انجام دهنده مجاز نمی باشد",
            59 => "کارت مظنون به تقلب است",
            60 => "بنابر توصیه موسسه یا بانک مدیر کارت به پذیرنده کارت  ،تراکنش درخواستی پذیرفته نمی شود",
            61 => "مبلغ تراکنش کمتر از حد تعیین شده توسط صادر کننده کارت و یا بیشتر از حد مجاز می باشد",
            62 => "کارت محدود شده است",
            63 => "تمهیدات امنیتی نقض گردیده است",
            64 => "مبلغ تراکنش اصلی ن امعتبر است( .تراکنش مالی اصلی با این مبلغ نمی باشد)",
            65 => "تعداد درخواست تراکنش بیش از حد مجاز می باشد",
            66 => "در پی تراکنش درخواستی پذیرنده با بخش امنیتی موسسه یا بانک تماس گرفته است ( و یا میگیرد )",
            67 => "کارت توسط دستگاه ضبط شود",
            68 => "پاسخ الزم برای تکمیل یا انجام تراکنش خیلی دیر رسیده است",
            69 => "تعداد دفعات تکراررمز از حد مجاز گذشته است",
            75 => "تعداد دفعات ورود رمزغلط بیش از حدمجاز است",
            76 => "مبلغ انتقال داده شده معتبر نیست",
            77 => "روز مالی تراکنش نا معتبر است یا مهلت زمان ارسال اصالحیه به پایان رسیده است",
            78 => "کارت فعال نیست",
            79 => "حساب متصل به کارت نا معتبر است یا دارای اشکال است",
            80 => "درخواست تراکنش رد شده است",
            81 => "کارت پذیرفته نشد ( اختصاصی )SLM",
            82 => "پیام تایید از دستگاه خود پرداز دریافت نشده است ( اختصاصی )SLm",
            83 => "سرویس گر سوئیچ کارت تراکنش را نپذیرفته است",
            84 => "در تراکنشهایی که انجام آن مستلزم ارتباط با صادر کننده است در صورت فعال نبودن صادر کننده این پیام در پاسخ ارسال خواهد شد",
            85 => "پردازش گر و یا مبدا انجام تراکنش معتبر نیست",
            86 => "تراکنش درخواستی برای بخش سخت افزاری درخواست شده از آن قابل قبول نیست",
            87 => "سیستم در تبادل کلید رمز دچار مشکل شده است ( کد پاسخ اختصاصی )SLM",
            88 => "سیستم در تبادل کلید  MACدچار مشکل شده است (کد پاسخ اختصاصی ) SLM",
            89 => "عدم تایید تراکنش توسط سوئیچ خارجی ( کد پاسخ اختصاصی )SLM",
            90 => "سامانه مقصد تراکنش درحال انجام عملیات پایان روز می باشد",
            91 => "سیستم صدور مجوز انجام تراکنش موقتا غیر فعال است و یا زمان تعیین شده برای صدو مجوز به پایان رسیده است",
            92 => "مقصد تراکنش پیدا نشد",
            93 => "امکان تکمیل تراکنش وجود ندارد",
            94 => "ارسال تکراری تراکنش بوجود آمده است",
            95 => "در عملیات مغایرت گیری ترمینال اشکال رخ داده است",
            96 => "اشکال در عملکرد سیستم",
            97 => "تراکنش از سوی صادرکننده کارت رد شده است",
            99 => "خطای صادر کنندگی",
            200 => "سایر خطاهای نگاشت نشده سامانه های بانکی",


        ];
    }

    private function errReturn($result, $default_err = 1002)
    {

        if (isset($result['Status'])) {
            $result['status'] = $result['Status'];
        }
        
        if (isset($result['Message'])) {
            $this->messages[$result['status']] = $result['Message'];
        }
        return (isset($this->messages[$result['status']])) ? $result['status'] : 1002;
    }
    public function startPay($orderId, $amount, $callbackUrl)
    {
        require_once __DIR__ . DIRECTORY_SEPARATOR . "lib" . DIRECTORY_SEPARATOR . "nusoap.php";
        $client = new nusoap_client($this->config['url'], 'wsdl');
        $client->soap_defencoding = 'UTF-8';
        $client->decode_utf8 = false;

        $err = $client->getError();
        if ($err) {
            return 1001;
        }
        /* Connect successful =============================================== */

        $parameters = ['requestData' => [
            //'pin' => $this->config['PIN'],
            'LoginAccount' => $this->config['PIN'],
            'Amount' => (int) $amount,
            'OrderId' => $orderId,
            'CallBackUrl' => $callbackUrl,
        ]];
        $result = $client->call('SalePaymentRequest', $parameters);


        /* Check for errors ================================================= */
        if ($client->fault) {
            return (isset($this->messages[$result])) ? $result : 1002;
        }
        $err = $client->getError();
        if ($err) {
            return (isset($this->messages[$err])) ? $err : 1002;
        }


        if (isset($result['SalePaymentRequestResult']) && $result['SalePaymentRequestResult'] != "") {
            $result = $result['SalePaymentRequestResult'];
        } else {
            return 1001;
        }
        /* Success ========================================================== */
        if (isset($result['Status'])) {
            $result['status'] = $result['Status'];
        }
        if (isset($result['status']) && $result['status'] == 0 && isset($result['Token']) && $result['Token'] != "") {
            $token = $result['Token'];
        } else {
            return $this->errReturn($result);
        }

        $gateway_url = $this->config['gateway_url'] . $token;

        //var_dump($gateway_url);
        //die('----');
        uri::redirect($gateway_url);
        return 1003;
    }

    public function payStatus($orderId, $gatewayData = [])
    {
        $return = [
            'status' => NULL,
            'gateway_reciept' => NULL,
            'gateway_meta' => NULL
        ];


        if (isset($_POST['Status'])) {
            $_POST['status'] = $_POST['Status'];
        }
        if (isset($_POST['status']) && $_POST['status'] == 0 && isset($_POST['Token']) && $_POST['Token'] != "") {

            //settle
            /* ================================================================== */
            $client = new nusoap_client($this->config['gonfirm'], 'wsdl');
            $client->soap_defencoding = 'UTF-8';
            $client->decode_utf8 = false;

            $client->soap_defencoding = 'UTF-8';

            $err = $client->getError();
            if ($err) {
                return 1001;
            }

            $parameters = ['requestData' => [
                'LoginAccount' => $this->config['PIN'],
                'Token' =>  $_POST['Token']
            ]];
            $result = $client->call('PinPaymentEnquiry', $parameters);

            /* Check for errors ================================================= */
            if ($client->fault) {
                return (isset($this->messages[$result])) ? $result : 1002;
            }
            $err = $client->getError();
            if ($err) {
                return (isset($this->messages[$err])) ? $err : 1002;
            }


            if (isset($result['ConfirmPaymentResult']) && $result['ConfirmPaymentResult'] != "") {
                $result = $result['ConfirmPaymentResult'];
            } else {
                return 1001;
            }

            if (isset($result['Status'])) {
                $result['status'] = $result['Status'];
            }
            
            if (isset($result['status']) && $result['status'] == 0 && isset($result['RRN']) && $result['RRN'] > 0) {

                $bankReference = (isset($result['RRN']) && $result['RRN'] > 0)  ? $result['RRN'] : "";
                $return['status'] = $this->gatewaySuccessStatus;
                $return['gateway_reciept'] = $bankReference;
                $return['gateway_meta'] = ['post' => $_POST, 'result' => $result];
                /* ------------------------------------------------------ */
                return $return;
            }
            return $this->errReturn($result);
        }
        $return['status'] = 1004;
        return $return;
    }

    public function verifyPay($orderId, $gatewayMeta = [])
    {
        return $this->gatewaySuccessStatus;
    }

    public function rollBack($orderId, $gatewayMeta = [])
    { }
}
